# Pandas Handson

Tasks To be Performed:

1. Given a sample list, tuple and a set with elements as numbers from 1-10. Convert each
of the data types into a pandas series. Create a separate list of index values for the
series.

In [1]:
import pandas as pd

In [10]:
l1 = [1,2,3,4,5,6,7,8,9,10]
my_index = ['a','b','c','d','e','f','g','h','i','j']
s1 = pd.Series(l1,index=my_index)
print(s1)

a     1
b     2
c     3
d     4
e     5
f     6
g     7
h     8
i     9
j    10
dtype: int64

In [3]:
type(s1)

pandas.core.series.Series

In [11]:
t1 = (1,2,3,4,5,6,7,8,9,10)
my_index = ['a','b','c','d','e','f','g','h','i','j']
s2 = pd.Series(t1,index=my_index)
print(s2)

a     1
b     2
c     3
d     4
e     5
f     6
g     7
h     8
i     9
j    10
dtype: int64

In [5]:
s1 = {1,2,3,4,5,6,7,8,9,10}
print(s1)

{1, 2, 3, 4, 5, 6, 7, 8, 9, 10}

In [7]:
type(s1)

set

In [8]:
s3 = pd.Series(s1)
print(s3)

TypeError: 'set' type is unordered

In [12]:
s4 = pd.Series(list(s1),index=my_index)

print(s4)

a     1
b     2
c     3
d     4
e     5
f     6
g     7
h     8
i     9
j    10
dtype: int64

2. Create a python dictionary with three key value pairs. Keep the keys as the first names,
and the respective last names as values in the dictionary. Use the dictionary to create a
pandas series.

In [13]:
dict1 = {'virat':'kohli','rahul':'dravid','rohit':'sharma'}
print(dict1)

{'virat': 'kohli', 'rahul': 'dravid', 'rohit': 'sharma'}

In [14]:
type(dict1)

dict

In [15]:
s5 = pd.Series(dict1)
print(s5)

virat     kohli
rahul    dravid
rohit    sharma
dtype: object

3. Create a pandas series, with the elements as numbers from 1-10. Use the index values
starting from 0-10. For the above series:
    
a. Convert it to a list.

b. Convert it to a dictionary.

c. Convert it to a tuple.

d. Convert it to a set.

In [16]:
ser1 = pd.Series(range(1,11))
ser1

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [17]:
l = list(ser1)
l

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [18]:
d = dict(ser1)
d

{0: 1, 1: 2, 2: 3, 3: 4, 4: 5, 5: 6, 6: 7, 7: 8, 8: 9, 9: 10}

In [19]:
t = tuple(ser1)
t

(1, 2, 3, 4, 5, 6, 7, 8, 9, 10)

In [20]:
s = set(ser1)
s

{1, 2, 3, 4, 5, 6, 7, 8, 9, 10}

4. Create a sample pandas series with x integer elements. Perform the following operations
on the same:
    
a. Print the first 5 elements of the series

b. Print the last 5 elements of the series

c. Insert an integer value ‘50’ at the index 5.

d. Update the last element in the series with the value 100.

e. Delete the first element from the series.

In [31]:
s = pd.Series([1,2,3,4,5,6,7,8,9,10])
s

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [23]:
#a
s[:5]

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [24]:
s.head()

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [25]:
#b
s[5:]

5     6
6     7
7     8
8     9
9    10
dtype: int64

In [26]:
s.tail()

5     6
6     7
7     8
8     9
9    10
dtype: int64

In [ ]:
#c

In [27]:
s[5]

6

In [28]:
s[5]=50

In [29]:
print(s)

0     1
1     2
2     3
3     4
4     5
5    50
6     7
7     8
8     9
9    10
dtype: int64

In [32]:
s

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [34]:
l=list(s)
l.insert(5,50)
s = pd.Series(l)
s

0      1
1      2
2      3
3      4
4      5
5     50
6      6
7      7
8      8
9      9
10    10
dtype: int64

In [35]:
#d

In [36]:
s[10]=100

In [37]:
s

0       1
1       2
2       3
3       4
4       5
5      50
6       6
7       7
8       8
9       9
10    100
dtype: int64

In [38]:
#e
s = s.drop(0)
s

1       2
2       3
3       4
4       5
5      50
6       6
7       7
8       8
9       9
10    100
dtype: int64

5. For a given pandas series obtained in the 4th step. Write a sample code to find the
element 100 in the series.

In [39]:
s

1       2
2       3
3       4
4       5
5      50
6       6
7       7
8       8
9       9
10    100
dtype: int64

In [40]:
100 in s.values

True

In [41]:
s.isin([100])

1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10     True
dtype: bool

In [42]:
for x in s:
    if x == 100:
        print(x)
        break

100

6. For the given series A and B, perform concatenation on the same.

series_A = pd.Series([1,2,3,4,5])

series_B = pd.Series([6,7,8,9,10])

In [44]:
series_A = pd.Series([1,2,3,4,5])
series_B = pd.Series([6,7,8,9,10])

In [48]:
a = pd.concat([series_A,series_B])
a

0     1
1     2
2     3
3     4
4     5
0     6
1     7
2     8
3     9
4    10
dtype: int64

In [49]:
a = pd.concat([series_A,series_B],ignore_index=True)
a

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

7. Using loops in python, print all the elements within a pandas series.
Sample = pd.Series([1,2,3,4,5,6,7,8,9,10])

In [50]:
Sample = pd.Series([1,2,3,4,5,6,7,8,9,10])
Sample

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [51]:
for i in Sample:
    print(i)

1
2
3
4
5
6
7
8
9
10

8. For a given nested list and a sample dictionary, create two data frames using pandas.

List = [['AA','BB','CC'], ['DD','EE','FF'], ['GG','HH','II']]

Dictionary = { 'Kris': ['Jordan', 12,22],'Memphis': ['Depay', 23, 24]}

In [52]:
List = [['AA','BB','CC'], ['DD','EE','FF'], ['GG','HH','II']]
List

[['AA', 'BB', 'CC'], ['DD', 'EE', 'FF'], ['GG', 'HH', 'II']]

In [54]:
d1 = pd.DataFrame(List,columns=["x",'y','z'])
d1

    x   y   z
0  AA  BB  CC
1  DD  EE  FF
2  GG  HH  II

In [55]:
Dictionary = { 'Kris': ['Jordan', 12,22],'Memphis': ['Depay', 23, 24]}
Dictionary

{'Kris': ['Jordan', 12, 22], 'Memphis': ['Depay', 23, 24]}

In [56]:
d2 = pd.DataFrame(Dictionary)
d2

     Kris Memphis
0  Jordan   Depay
1      12      23
2      22      24

In [57]:
d1 = { 'Rohit' : ['Sharma'],
     'Virat' : ['Kohli'],
     'Shubhman' : ['Gill']}
df = pd.DataFrame(d1)
df

    Rohit  Virat Shubhman
0  Sharma  Kohli     Gill

9. Create a pandas Dataframe with two columns = [‘Name’, ‘Age’]. Perform the following
operations on the same.

a. Print the first 3 rows of the Data Frame .

b. Print the rows that have the age greater than 15.

c. Insert 5 imaginary names and ages as values to the pandas Data Frame .

d. Update the 5th row so that the name = john and age=56.

e. Delete the first row from the Data Frame .

In [110]:
data = [["akash",10],['nick',40],['Joey',50],['ishita',60]]
data

[['akash', 10], ['nick', 40], ['Joey', 50], ['ishita', 60]]

In [111]:
df = pd.DataFrame(data,columns=['Name','Age'])
df

     Name  Age
0   akash   10
1    nick   40
2    Joey   50
3  ishita   60

In [112]:
#a
df.head(3)

    Name  Age
0  akash   10
1   nick   40
2   Joey   50

In [113]:
#b
df[df.Age>15]

     Name  Age
1    nick   40
2    Joey   50
3  ishita   60

In [114]:
df

     Name  Age
0   akash   10
1    nick   40
2    Joey   50
3  ishita   60

In [ ]:
#c

In [115]:
df.loc[4]=["priya",21]

In [116]:
df

     Name  Age
0   akash   10
1    nick   40
2    Joey   50
3  ishita   60
4   priya   21

In [117]:
#df.loc[5,'Name']='John'
#df.loc[5,'Age']=60

In [118]:
df

     Name  Age
0   akash   10
1    nick   40
2    Joey   50
3  ishita   60
4   priya   21

In [119]:
l1=[['ram',70],['charlie',56],['aman',35]]

In [120]:
df2 = pd.DataFrame(l1,columns=['Name','Age'])

In [121]:
df2

      Name  Age
0      ram   70
1  charlie   56
2     aman   35

In [122]:
df

     Name  Age
0   akash   10
1    nick   40
2    Joey   50
3  ishita   60
4   priya   21

In [123]:
df2

      Name  Age
0      ram   70
1  charlie   56
2     aman   35

In [124]:
df3 = pd.concat([df,df2],ignore_index=True)

In [125]:
df3

      Name  Age
0    akash   10
1     nick   40
2     Joey   50
3   ishita   60
4    priya   21
5      ram   70
6  charlie   56
7     aman   35

In [126]:
#d
df3.loc[4]=['John',56]

In [127]:
df3

      Name  Age
0    akash   10
1     nick   40
2     Joey   50
3   ishita   60
4     John   56
5      ram   70
6  charlie   56
7     aman   35

In [130]:
#e
df3=df3.drop(0)

10. For the Data Frame obtained from step 9, convert the same to a list and a dictionary
respectively.

In [131]:
df3

      Name  Age
1     nick   40
2     Joey   50
3   ishita   60
4     John   56
5      ram   70
6  charlie   56
7     aman   35

In [132]:
my_list = df3.to_dict("records")  #converting the dataframe to list of dictionaries

In [133]:
my_list

[{'Name': 'nick', 'Age': 40},
 {'Name': 'Joey', 'Age': 50},
 {'Name': 'ishita', 'Age': 60},
 {'Name': 'John', 'Age': 56},
 {'Name': 'ram', 'Age': 70},
 {'Name': 'charlie', 'Age': 56},
 {'Name': 'aman', 'Age': 35}]

In [134]:
my_dict = df3.to_dict("list") #converting the dataframe to a dictionary of list
my_dict

{'Name': ['nick', 'Joey', 'ishita', 'John', 'ram', 'charlie', 'aman'],
 'Age': [40, 50, 60, 56, 70, 56, 35]}

In [135]:
dict(df3)

{'Name': 1       nick
 2       Joey
 3     ishita
 4       John
 5        ram
 6    charlie
 7       aman
 Name: Name, dtype: object,
 'Age': 1    40
 2    50
 3    60
 4    56
 5    70
 6    56
 7    35
 Name: Age, dtype: int64}

In [138]:
dict(df3.values)

{'nick': 40,
 'Joey': 50,
 'ishita': 60,
 'John': 56,
 'ram': 70,
 'charlie': 56,
 'aman': 35}

In [136]:
l1 = list(df3.values)
l1

[array(['nick', 40], dtype=object),
 array(['Joey', 50], dtype=object),
 array(['ishita', 60], dtype=object),
 array(['John', 56], dtype=object),
 array(['ram', 70], dtype=object),
 array(['charlie', 56], dtype=object),
 array(['aman', 35], dtype=object)]

In [137]:
l2 = df3.values.tolist()
l2

[['nick', 40],
 ['Joey', 50],
 ['ishita', 60],
 ['John', 56],
 ['ram', 70],
 ['charlie', 56],
 ['aman', 35]]

11. Create two separate Data Frame s A and B, and perform the following operations on
them.

a. Concatenate the two Data Frame s to a new Data Frame C.

b. Split the Data Frame C row wise.

c. Split the Data Frame column wise based on a condition. For example - columns
values greater than 10, column values less than 10, etc.

In [140]:
A = pd.DataFrame([1,2,3,4,5])
B = pd.DataFrame([11,12,13,14,15])

In [141]:
A

   0
0  1
1  2
2  3
3  4
4  5

In [142]:
B

    0
0  11
1  12
2  13
3  14
4  15

In [143]:
#a
C = pd.concat([A,B],ignore_index=True)
C

    0
0   1
1   2
2   3
3   4
4   5
5  11
6  12
7  13
8  14
9  15

In [144]:
#b
df4 = C.iloc[:5,:]

In [145]:
df4

   0
0  1
1  2
2  3
3  4
4  5

In [148]:
df5 = C.loc[1]

In [149]:
df5

0    2
Name: 1, dtype: int64

In [150]:
df6 = C.iloc[2:7,:]
df6

    0
2   3
3   4
4   5
5  11
6  12

In [151]:
C

    0
0   1
1   2
2   3
3   4
4   5
5  11
6  12
7  13
8  14
9  15

In [152]:
#c
g_10 = C[C[0]>10]
g_10

    0
5  11
6  12
7  13
8  14
9  15

In [153]:
g_4 = C[C[0]>4]
g_4

    0
4   5
5  11
6  12
7  13
8  14
9  15